OpenFOAM-v1812/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/successor/setups.orig/common/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 15 0);

boundaryField
{
    "p[0-9]+"
    {
        type            freestream;
        freestreamBC
        {
            type        timeVaryingMappedFixedValue;
            offset      (0 0 0);
            setAverage  off;
            mapMethod   nearest;
            value       $internalField;
        }
        value           $internalField;
    }

    terrain
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    top
    {
        type            slip;
    }
}


// ************************************************************************* //
